# Уявимо, що ми хочемо змінити оцінку Bob
import json

# Завантаження даних з файлу
with open("students.json", "r") as f:
    students = json.load(f)

for s in students:
    if s["name"] == "Bob":
        s["grade"] = 95

# Але тепер треба знову повністю перезаписати файл
with open("students.json", "w") as f:
    json.dump(students, f)


#Недоліки:
#Перезапис файлу після кожної зміни
#Немає ефективного пошуку
#Немає механізмів одночасної роботи кількох користувачів
#Можна легко пошкодити файл
#Логічний висновок: "Потрібен інструмент, який вміє зберігати, швидко шукати, оновлювати й видаляти дані".
